name: "mnist_model"
platform: "onnxruntime_onnx"
max_batch_size: 256


input [
    {
        name: "input"
        data_type: TYPE_FP32
        dims: [ 784 ]
    }
]

output [
    {
        name: "output"
        data_type: TYPE_FP32
        dims: [ 10 ]
    }
]

instance_group [
    {
      count: 3
      kind: KIND_CPU
    }
]


dynamic_batching: {max_queue_delay_microseconds: 400}
